Revit 2027 API
FlexPipe.IsFlexPipeTypeId Method
 Checks if given type is valid flexible pipe type.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsFlexPipeTypeId(
	Document document,
	ElementId pipeTypeId
)
Public Shared Function IsFlexPipeTypeId (
	document As Document,
	pipeTypeId As ElementId
) As Boolean
public:
static bool IsFlexPipeTypeId(
	Document^ document,
	ElementId^ pipeTypeId
)
static member IsFlexPipeTypeId :
        document : Document *
        pipeTypeId : ElementId -> bool
Parameters
document Document
 The document.
pipeTypeId ElementId
 ElementId of the flexible pipe type to check.
Return Value
Boolean
 True if flexible pipe type can used for this pipe, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A type is valid for flexible pipe if it can be used to the flexible pipe element.
See Also
Reference
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace